#define _CRT_SECURE_NO_WARNINGS
#include <iostream>
#include <stdio.h>
#include <cstring>
using namespace std;



int temp()
{
	setlocale(LC_ALL, "Russian");
	char str[] = "Иванов 1,0000 2 Смирнов 0,7412 3 Кузнецов 0,7011 4 Попов 0,5334 5 Васильев 0,4948 6 Петров 0,4885 7 Соколов 0,4666 8 Михайлов 0,3955 9 Новиков 0,3743 10 Федоров 0,3662 11 Морозов 0,3639 12 Волков 0,3636 13 Алексеев 0,3460 14 Лебедев 0,3431 15 Семенов 0,3345 16 Егоров 0,3229 17 Павлов 0,3226 18 Козлов 0,3139 19 Степанов 0,3016 20 Николаев 0,3005 21 Орлов 0,2976 22 Андреев 0,2972 23 Макаров 0,2924 24 Никитин 0,2812 25 Захаров 0,2755 26 Зайцев 0,2728 27 Соловьев 0,2712 28 Борисов 0,2710 29 Яковлев 0,2674 30 Григорьев 0,2541 31 Романов 0,2442 32 Воробьев 0,2371 33 Сергеев 0,2365 34 Кузьмин 0,2255 35 Фролов 0,2235 36 Александров 0,2234 37 Дмитриев 0,2171 38 Королев 0,2083 39 Гусев 0,2075 40 Киселев 0,2070 41 Ильин 0,2063 42 Максимов 0,2059 43 Поляков 0,2035 44 Сорокин 0,1998 45 Виноградов 0,1996 46 Ковалев 0,1978 47 Белов 0,1964 48 Медведев 0,1953 49 Антонов 0,1928 50 Тарасов 0,1896 51 Жуков 0,1894 52 Баранов 0,1883 53 Филиппов 0,1827 54 Комаров 0,1799 55 Давыдов 0,1767 56 Беляев 0,1750 57 Герасимов 0,1742 58 Богданов 0,1706 59 Осипов 0,1702 60 Сидоров 0,1695 61 Матвеев 0,1693 62 Титов 0,1646 63 Марков 0,1628 64 Миронов 0,1625 65 Крылов 0,1605 66 Куликов 0,1605 67 Карпов 0,1584 68 Власов 0,1579 69 Мельников 0,1567 70 Денисов 0,1544 71 Гаврилов 0,1540 72 Тихонов 0,1537 73 Казаков 0,1528 74 Афанасьев 0,1516 75 Данилов 0,1505 76 Савельев 0,1405 77 Тимофеев 0,1403 78 Фомин 0,1401 79 Чернов 0,1396 80 Абрамов 0,1390 81 Мартынов 0,1383 82 Ефимов 0,1377 83 Федотов 0,1377 84 Щербаков 0,1375 85 Назаров 0,1366 86 Калинин 0,1327 87 Исаев 0,1317 88 Чернышев 0,1267 89 Быков 0,1255 90 Маслов 0,1249 91 Родионов 0,1248 92 Коновалов 0,1245 93 Лазарев 0,1236 94 Воронин 0,1222 95 Климов 0,1213 96 Филатов 0,1208 97 Пономарев 0,1203 98 Голубев 0,1200 99 Кудрявцев 0,1186 100 Прохоров";

	char sep[] = { " " };

	char* word = strtok(str, sep);
	int i = 0;
	while (word != nullptr)
	{
		if (i % 3 == 0)
			cout << word << endl;
		i++;
		word = strtok(nullptr, sep);
	}

	
	return 0;
}
